shares/smallPoolFire3D/constant/pyrolysisZones
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      pyrolysisZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pyrolysis
{
    active          false;

    pyrolysisModel  none;

    regionName      panelRegion;

    reactingOneDimCoeffs
    {
        radFluxName     qr;

        minimumDelta    1e-8;

        moveMesh        false;
    }

    infoOutput      false;
}


// ************************************************************************* //
